In [2]:
#AGGREGATING NAD GROUPING DATA....
import pandas as pd

In [3]:
df=pd.read_csv("datasets/groupbydata2.csv")
df

          date     city  temperature  humidity
0   01/01/2022   lahore            8        60
1   02/01/2022   lahore           10        58
2   03/01/2022   lahore            5        51
3   04/01/2022   lahore            6        49
4   05/01/2022   lahore           12        54
5   01/01/2022  karachi           18        74
6   02/01/2022  karachi           10        71
7   03/01/2022  karachi           12        78
8   04/01/2022  karachi           15        76
9   05/01/2022  karachi           16        70
10  01/01/2022   murree           -5        61
11  02/01/2022   murree           -3        68
12  03/01/2022   murree           -4        69
13  04/01/2022   murree           -1        63
14  05/01/2022   murree           -7        72

In [4]:
#AGGREGATE FUNCTION ON ENTIRE DATAFRAME...
df.min() #return minimum of all columns

date           01/01/2022
city              karachi
temperature            -7
humidity               49
dtype: object

In [5]:
df.count() #count of data values in each coulumn

date           15
city           15
temperature    15
humidity       15
dtype: int64

In [6]:
df.median(numeric_only=True) #returns median of each column having numerc values only

temperature     8.0
humidity       68.0
dtype: float64

In [7]:
# agg()...
df.agg(["min","max", "mean", "count"])

C:\Users\ASCC\AppData\Local\Temp\ipykernel_10440\4011566835.py:2: FutureWarning: ['date', 'city'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.agg(["min","max", "mean", "count"])

             date     city  temperature   humidity
min    01/01/2022  karachi    -7.000000  49.000000
max    05/01/2022   murree    18.000000  78.000000
mean          NaN      NaN     6.133333  64.933333
count          15       15    15.000000  15.000000

In [8]:
# describe()...
df.describe() #returns decscriptive statistics on numeric columns in dataframe

       temperature   humidity
count    15.000000  15.000000
mean      6.133333  64.933333
std       8.253715   9.153194
min      -7.000000  49.000000
25%      -2.000000  59.000000
50%       8.000000  68.000000
75%      12.000000  71.500000
max      18.000000  78.000000

In [14]:
# All Above on single series a s wel...
print("MAX: ",df['temperature'].max())
print("AGG:\n",df['temperature'].agg(["min",'max','count']))
print("Describe:\n",df['temperature'].describe())

MAX:  18
AGG:
 min      -7
max      18
count    15
Name: temperature, dtype: int64
Describe:
 count    15.000000
mean      6.133333
std       8.253715
min      -7.000000
25%      -2.000000
50%       8.000000
75%      12.000000
max      18.000000
Name: temperature, dtype: float64

In [15]:
# apply( ) on series object...
df.temperature.apply(lambda x : x*9/5+32)

0     46.4
1     50.0
2     41.0
3     42.8
4     53.6
5     64.4
6     50.0
7     53.6
8     59.0
9     60.8
10    23.0
11    26.6
12    24.8
13    30.2
14    19.4
Name: temperature, dtype: float64

In [17]:
#GROUPBY()....
df.loc[df['city']=='lahore']  #finging rows in which city is lahore only

         date    city  temperature  humidity
0  01/01/2022  lahore            8        60
1  02/01/2022  lahore           10        58
2  03/01/2022  lahore            5        51
3  04/01/2022  lahore            6        49
4  05/01/2022  lahore           12        54

In [20]:
df.loc[df['city']=='karachi']
df[df['city']=='karachi']

         date     city  temperature  humidity
5  01/01/2022  karachi           18        74
6  02/01/2022  karachi           10        71
7  03/01/2022  karachi           12        78
8  04/01/2022  karachi           15        76
9  05/01/2022  karachi           16        70

In [22]:
df[df['city']=='murree']
df.loc[df['city']=='murree']

          date    city  temperature  humidity
10  01/01/2022  murree           -5        61
11  02/01/2022  murree           -3        68
12  03/01/2022  murree           -4        69
13  04/01/2022  murree           -1        63
14  05/01/2022  murree           -7        72

In [27]:
mt=df.loc[df['city']=='murree'].temperature.min()
mt

-7

In [29]:
kt=df.loc[df['city']=='karachi'].temperature.min()
kt

10

In [30]:
lt=df.loc[df['city']=='lahore'].temperature.min()
lt

5

In [31]:
newS=pd.Series(data=[lt,kt,mt], index=["lhr_min","kch_min","mur_min"])
newS.name="Min Temp"
newS

lhr_min     5
kch_min    10
mur_min    -7
Name: Min Temp, dtype: int64

In [34]:
#MORE ELEGENT WAY TO DO THE ABOVE PROCESS....
# 1. split
gr=df.groupby("city")
for a in gr: #return each grouped dataframe separately...
    print(a)

('karachi',          date     city  temperature  humidity
5  01/01/2022  karachi           18        74
6  02/01/2022  karachi           10        71
7  03/01/2022  karachi           12        78
8  04/01/2022  karachi           15        76
9  05/01/2022  karachi           16        70)
('lahore',          date    city  temperature  humidity
0  01/01/2022  lahore            8        60
1  02/01/2022  lahore           10        58
2  03/01/2022  lahore            5        51
3  04/01/2022  lahore            6        49
4  05/01/2022  lahore           12        54)
('murree',           date    city  temperature  humidity
10  01/01/2022  murree           -5        61
11  02/01/2022  murree           -3        68
12  03/01/2022  murree           -4        69
13  04/01/2022  murree           -1        63
14  05/01/2022  murree           -7        72)

In [35]:
gr.groups #list of all unique grousps with the indices

{'karachi': [5, 6, 7, 8, 9], 'lahore': [0, 1, 2, 3, 4], 'murree': [10, 11, 12, 13, 14]}

In [36]:
gr.get_group("karachi") # to get a specific groups dataframe

         date     city  temperature  humidity
5  01/01/2022  karachi           18        74
6  02/01/2022  karachi           10        71
7  03/01/2022  karachi           12        78
8  04/01/2022  karachi           15        76
9  05/01/2022  karachi           16        70

In [39]:
gr.size() #returns size of each group in dataframe

city
karachi    5
lahore     5
murree     5
dtype: int64

In [45]:
# 2. APPLY ANY AGGREGATE FUNCTION...
df.groupby('city').get_group('lahore').temperature.min()
df.groupby('city').get_group('karachi').temperature.min()
df.groupby('city').get_group('murree').temperature.min()

-7

In [46]:
# 3. COMBINE...
lh=df.groupby('city').get_group('lahore').temperature.min()
krr=df.groupby('city').get_group('karachi').temperature.min()
mr=df.groupby('city').get_group('murree').temperature.min()


new=pd.Series(data=[lh,krr,mr], index=['lh_min', 'kr-min', 'mr_min'])
new.name='New Temp data'
new

lh_min     5
kr-min    10
mr_min    -7
Name: New Temp data, dtype: int64

In [47]:
# ELEGENT ONE LINER...
df.groupby('city').temperature.min()

city
karachi    10
lahore      5
murree     -7
Name: temperature, dtype: int64

In [48]:
#agg() in groupby()....
df.groupby('city').temperature.agg(['min','max','mean','count'])

         min  max  mean  count
city
karachi   10   18  14.2      5
lahore     5   12   8.2      5
murree    -7   -1  -4.0      5

In [58]:
#STACKOVERFLOW DATASET PRCTISE....
df=pd.read_csv('datasets/so_survey_subset.csv')
df

,Respondent,MainBranch,Hobbyist,Country,YearsCode,ConvertedComp,LanguageWorkedWith,SocialMedia,Age,Gender
0,1,I am a student who is learning to code,Yes,United Kingdom,4,NaN,HTML/CSS;Java;JavaScript;Python,Twitter,14.0,Man
1,2,I am a student who is learning to code,No,Bosnia and Herzegovina,NaN,NaN,C++;HTML/CSS;Python,Instagram,19.0,Man
2,3,"I am not primarily a developer, but I write co...",Yes,Thailand,3,8820.0,HTML/CSS,Reddit,28.0,Man
3,4,I am a developer by profession,No,United States,3,61000.0,C;C++;C#;Python;SQL,Reddit,22.0,Man
4,5,I am a developer by profession,Yes,Ukraine,16,NaN,C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA,Facebook,30.0,Man
...,...,...,...,...,...,...,...,...,...,...
88878,88377,NaN,Yes,Canada,NaN,NaN,HTML/CSS;JavaScript;Other(s):,YouTube,NaN,Man
88879,88601,NaN,No,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88880,88802,NaN,No,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88881,88816,NaN,No,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88882,88863,NaN,Yes,Spain,8,NaN,Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...,WhatsApp,18.0,Man

In [62]:
sdf=pd.read_csv("datasets/so_survey_subset_schema.csv", index_col='Column') #made Column Label as Index
sdf

                                                         QuestionText
Column
Respondent          Randomized respondent ID number (not in order ...
MainBranch          Which of the following options best describes ...
Hobbyist                                      Do you code as a hobby?
Country                     In which country do you currently reside?
YearsCode           Including any education, how many years have y...
ConvertedComp       Salary converted to annual USD salaries using ...
LanguageWorkedWith  Which of the following programming, scripting,...
SocialMedia               What social media site do you use the most?
Age                 What is your age (in years)? If you prefer not...
Gender              Which of the following do you currently identi...

In [63]:
sdf.loc['Hobbyist'] #tells us what Hobbyist Column is doing

QuestionText    Do you code as a hobby?
Name: Hobbyist, dtype: object

In [61]:
df['Hobbyist'] #whole data series of Hobbyist

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [64]:
df['Hobbyist'].value_counts() #count of unique values in series

Yes    71257
No     17626
Name: Hobbyist, dtype: int64

In [65]:
df['Country'].value_counts().count() #shows total count of unique countries in the series...

179

In [73]:
#PRACTISE QUESTIONS.....
# 1. most popular social media website for every country...
df.groupby('Country')['SocialMedia'].value_counts().loc['Pakistan',:]

SocialMedia
WhatsApp                    266
Facebook                    232
YouTube                     182
LinkedIn                     71
Twitter                      58
Instagram                    41
Reddit                       28
I don't use social media     23
Snapchat                      5
Hello                         1
VK ВКонта́кте                 1
Name: SocialMedia, dtype: int64

In [79]:
df.groupby('Country')['SocialMedia'].value_counts().loc["China",:].max()

403

In [82]:
# 2. %age of people knows pyton in each country...
tc = df['Country'].value_counts()
tc.name="Total"
tc

United States        20949
India                 9061
Germany               5866
United Kingdom        5737
Canada                3395
                     ...
Tonga                    1
Timor-Leste              1
North Korea              1
Brunei Darussalam        1
Chad                     1
Name: Total, Length: 179, dtype: int64

In [92]:
pp=df.groupby('Country').LanguageWorkedWith.apply(lambda x:x.str.contains('Python').sum())
pp.name="Knows Python"
pp

Country
Afghanistan                              8
Albania                                 23
Algeria                                 40
Andorra                                  0
Angola                                   2
                                        ..
Venezuela, Bolivarian Republic of...    28
Viet Nam                                78
Yemen                                    3
Zambia                                   4
Zimbabwe                                14
Name: Knows Python, Length: 179, dtype: int64

In [93]:
result = pd.concat([tc,pp],axis=1)

In [94]:
result

                   Total  Knows Python
United States      20949         10083
India               9061          3105
Germany             5866          2451
United Kingdom      5737          2384
Canada              3395          1558
...                  ...           ...
Tonga                  1             0
Timor-Leste            1             1
North Korea            1             0
Brunei Darussalam      1             0
Chad                   1             0

[179 rows x 2 columns]

In [91]:
result.loc['Pakistan']

Total                 923
LanguageWorkedWith    251
Name: Pakistan, dtype: int64

In [95]:
result['%PYTHON']=result['Knows Python']/result['Total']

In [96]:
result

                   Total  Knows Python   %PYTHON
United States      20949         10083  0.481312
India               9061          3105  0.342677
Germany             5866          2451  0.417832
United Kingdom      5737          2384  0.415548
Canada              3395          1558  0.458910
...                  ...           ...       ...
Tonga                  1             0  0.000000
Timor-Leste            1             1  1.000000
North Korea            1             0  0.000000
Brunei Darussalam      1             0  0.000000
Chad                   1             0  0.000000

[179 rows x 3 columns]